#+TITLE: sql_in_10_minutes

** Retrieving Individual Column

#+begin_src sql :engine mysql :dbuser org :database grocer
select prod_name from Products;
#+end_src

#+RESULTS:
| prod_name           |
|---------------------|
| Fish bean bag toy   |
| Bird bean bag toy   |
| Rabbit bean bag toy |
| 8 inch teddy bear   |
| 12 inch teddy bear  |
| 18 inch teddy bear  |
| Raggedy Ann         |
| King doll           |
| Queen doll          |
*** Checking for No Value

#+begin_src sql :engine mysql :dbuser org :database grocer
select prod_name
from Products
where prod_price is null;
#+end_src


#+begin_src sql :engine mysql :dbuser org :database grocer
select cust_name
from Customers
where cust_email is null;
#+end_src

#+RESULTS:
| cust_name     |
|---------------|
| Kids Place    |
| The Toy Store |

*** The Percent Sign (%) Wildcard

#+begin_src sql :engine mysql :dbuser org :database grocer
 select prod_id, prod_name from Products where prod_name like  "fish%";
#+end_src

#+begin_src sql :engine mysql :dbuser org :database grocer
select prod_id, prod_name
from Products
where prod_name like "%bean bag%"
#+end_src

#+begin_src sql :engine mysql :dbuser org :database grocer
select prod_name from Products where prod_name like "f%y";
#+end_src

#+RESULTS:
| prod_name         |
|-------------------|
| Fish bean bag toy |

*** Using Views to Filter Unwanted Data

#+BEGIN_SRC sql :engine mysql :dbuser org :database grocer
CREATE VIEW CustomerEMailList AS
SELECT cust_id, cust_name, cust_email
FROM Customers
WHERE cust_email IS NOT NULL;
#+END_SRC

#+begin_src sql :engine mysql :dbuser org :database grocer
select * from CustomerEMailList;
#+end_src

#+RESULTS:
|    cust_id | cust_name     | cust_email            |
|------------+---------------+-----------------------|
| 1000000001 | Village Toys  | sales@villagetoys.com |
| 1000000003 | Fun4All       | jjones@fun4all.com    |
| 1000000004 | Fun4All       | dstephens@fun4all.com |
| 1000000005 | The Toy Store | kim@thetoystore.com   |
| 1000000006 | toy land      | sam@toyland.com       |


#+BEGIN_SRC sql :engine mysql :dbuser org :database grocer
create view OrderItemsExpanded as
select order_num, prod_id, quantity, item_price, quantity*item_price as expanded_price from OrderItems where order_num = 20008;
#+END_SRC

